import React from 'react';
import { Composition } from 'remotion';
import { HelloWorld, myCompSchema } from './HelloWorld';

const defaultProps = {
  koreanText: "엘로힘께서 땅과 하늘을 만드시던 그 날에,",
  hebrewText: "זֶהוּ סִפּוּר בְּרִיאַת הַשָּׁמַיִם וְהָאָרֶץ. בְּטֶרֶם צָמַח עֵשֶׂב אוֹ שִׂיחַ בָּאָרֶץ.",
  englishText: "",
  language: "ko" as const,
  videoFileName: "preview_keyframe_2.png",
  audioFileName: "narration.mp3",
  subtitlesJson: "[{\"text\":\"엘로힘은 땅의 흙으로 사람을 빚으시고,\",\"startSec\":3.1690947368421263,\"endSec\":6.385094736842127,\"heText\":\"וְכֹל׀ שִׂיחַ הַשָּׂדֶה טֶרֶם יִֽהְיֶה בָאָרֶץ וְכׇל־עֵשֶׂב הַשָּׂדֶה טֶרֶם יִצְמָח כִּי לֹא הִמְטִיר יְהֹוָה אֱלֹהִים עַל־הָאָרֶץ וְאָדָם אַיִן לַֽעֲבֹד אֶת־הָֽאֲדָמָֽה׃\",\"verseNum\":5,\"enText\":\"\"},{\"text\":\"그의 콧구멍에 생명의 숨을 불어넣으셨습니다.\",\"startSec\":6.985094736842129,\"endSec\":10.561094736842126,\"heText\":\"וְכֹל׀ שִׂיחַ הַשָּׂדֶה טֶרֶם יִֽהְיֶה בָאָרֶץ וְכׇל־עֵשֶׂב הַשָּׂדֶה טֶרֶם יִצְמָח כִּי לֹא הִמְטִיר יְהֹוָה אֱלֹהִים עַל־הָאָרֶץ וְאָדָם אַיִן לַֽעֲבֹד אֶת־הָֽאֲדָמָֽה׃\",\"verseNum\":5,\"enText\":\"\"},{\"text\":\"그러자 사람은 살아있는 존재가 되었습니다.\",\"startSec\":11.461094736842124,\"endSec\":15.205094736842124,\"heText\":\"וְכֹל׀ שִׂיחַ הַשָּׂדֶה טֶרֶם יִֽהְיֶה בָאָרֶץ וְכׇל־עֵשֶׂב הַשָּׂדֶה טֶרֶם יִצְמָח כִּי לֹא הִמְטִיר יְהֹוָה אֱלֹהִים עַל־הָאָרֶץ וְאָדָם אַיִן לַֽעֲבֹד אֶת־הָֽאֲדָמָֽה׃\",\"verseNum\":5,\"enText\":\"\"},{\"text\":\"엘로힘은 동쪽 에덴에 동산을 만드시고,\",\"startSec\":16.105094736842123,\"endSec\":18.84109473684212,\"heText\":\"וְאֵד יַֽעֲלֶה מִן־הָאָרֶץ וְהִשְׁקָה אֶֽת־כׇּל־פְּנֵי הָֽאֲדָמָֽה׃\",\"verseNum\":6,\"enText\":\"\"},{\"text\":\"그곳에 자신이 빚으신 사람을 두셨습니다.\",\"startSec\":19.44109473684212,\"endSec\":21.88909473684212,\"heText\":\"וַיִּיצֶר יְהֹוָה אֱלֹהִים אֶת־הָֽאָדָם עָפָר מִן־הָאֲדָמָה וַיִּפַּח בְּאַפָּיו נִשְׁמַת חַיִּים וַיְהִי הָֽאָדָם לְנֶפֶשׁ חַיָּֽה׃\",\"verseNum\":7,\"enText\":\"\"},{\"text\":\"그리고 보기에 아름답고 먹기에 좋은 온갖 나무들을\",\"startSec\":22.78909473684212,\"endSec\":23.182905263157874,\"heText\":\"וַיִּיצֶר יְהֹוָה אֱלֹהִים אֶת־הָֽאָדָם עָפָר מִן־הָאֲדָמָה וַיִּפַּח בְּאַפָּיו נִשְׁמַת חַיִּים וַיְהִי הָֽאָדָם לְנֶפֶשׁ חַיָּֽה׃\",\"verseNum\":7,\"enText\":\"\"}]",
  showSubtitle: true,
  showNarration: true,
  bgmFileName: "bgm.mp3",
  bgmVolume: 0.15,
};

export const RemotionRoot: React.FC = () => {
  return (
    <Composition
      id="HebrewBibleAnimationStudio"
      component={HelloWorld}
      durationInFrames={13249}
      fps={30}
      width={1920}
      height={1080}
      schema={myCompSchema}
      defaultProps={defaultProps}
    />
  );
};
